       77 wrk-produto pic x(10) value SPACES.
       77 wrk-estado pic x(02) value SPACES.
       77 wrk-valor pic 9(08)v99 value ZERO.
       77 wrk-frete pic 9(08)v99 value ZERO.
